<script setup>
import Accordion from '@/Components/Custom/Accordion.vue';
const props = defineProps({
    chapter: Object
})
</script>

<template>
    <Accordion>
    <template #head>{{ chapter.title }}</template>
    <div>
        <!-- Вступ -->
        <template v-if="chapter.key === 'intro-welcome'">
            Вітаємо в інструкції до сайту. Тут ви зможете довідатися про всі його основні функції. 
            Скористайтеся пошуком вище, щоб відфільтрувати ту інформацію, що вас цікавить.
            <figure><img src="/img/tutorial/map.jpg" alt="Вступ: Мапа окремого парку."><figcaption>Вступ: Мапа окремого парку.</figcaption></figure>
        </template>
        <!-- ПАРКИ -->
        <!-- Огляд парків -->
        <template v-if="chapter.key === 'parks-overview'">
           <p>Перейшовши у відповідне меню ви побачите перелік парків. Ви можете обрати певний із них для роботи із його вмістом.</p>
            <p>Тут ви можете змінювати назву та інформацію про парк, натиснувши на ✏️.</p>
            <div class="two-imgs-row">
                <figure><img src="/img/tutorial/park-info.jpg" alt="Інформація про парк."><figcaption>Інформація про парк.</figcaption></figure>
                <figure><img src="/img/tutorial/parks.jpg" alt="Меню парків."><figcaption>Меню парків.</figcaption></figure>
            </div>
           <p>Ви також можете переглянути свою позицію та шукати маркер за його інвентарним номером прямо з меню парків.</p>
        </template>

        <!-- Режими перегляду -->
        <template v-if="chapter.key === 'parks-modes'">
            <p>Ви можете переглядати парки у кількох режимах.</p>
            <p>Режими <i>"інфраструктура"</i> та <i>"зелені насадження"</i> доступні всім відвідувачам. Режим <i>"роботи"</i> – для персоналу.</p>
            <p>Режими по суті є наперед налаштованим набором фільтрів та порядку їхнього подання.</p>
            <ol>
                <li><i>Інфраструктура</i>: шукає і показує обрані типи інфраструктури моментально при виборі.</li>
                <li><i>Зелені насадження</i>: пропонує широкий фільтр для перегляду. Фільтр застосовується при натисканні на кнопку для зменшення навантаження.</li>
                <li><i>Роботи</i>: показує активні і ще не виконані роботи по парку.</li>
            </ol>
            <figure><img src="/img/tutorial/modes.jpg" alt="Режими роботи."><figcaption>Режими роботи.</figcaption></figure>
        </template>

        <!-- ФІЛЬТРИ -->
        <template v-if="chapter.key === 'filters'">
            <p>Фільтри застосовуються, щоб переглянути або підрахувати насадження за певним критерієм. Також вони корисні, щоб 
            додавати роботи зразу групі дерев <i>("всім кущам у поганому стані призначити полив")</i> або задіювати груповий експорт.</p> 
            <p>Фільтри поділяються на інфраструктурні і фільтри зелених насаджень. Другі, в свою чергу, поділяються на загальні та специфічні.</p>
            <ol>
                <li>Інфраструктурні: фільтрують типи інфраструктури та теги (тегами може бути будь-яка помітка, що додає гнучкості).</li>
                <li>Зелені, загальні: стан, виділ, вік, теги.</li>
                <li>Зелені, специфічні: фільтри за всіма характеристиками, властивими деревам, кущам, живоплотам, квіткам.</li>
            </ol>
            <p>Комбінуйте параметри (стани, теги, виділи) — мапа коригуватиметься під ваш вибір.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/filters-mobile.jpg" alt="Перегляд інфраструктурних фільтрів на телефоні.">
                    <figcaption>Перегляд інфраструктурних фільтрів на телефоні.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/filters-green.jpg" alt="Зелені фільтри.">
                    <figcaption>Зелені фільтри.</figcaption>
                </figure>
            </div>
        </template>

        <!-- МАРКЕРИ -->
        <!-- Про маркери -->
        <template v-if="chapter.key === 'markers-overview'">
            <p>Всі насадження та елементи інфраструктури є маркерами на мапі. Їх можна додавати, змінювати, переміщати, видаляти.</p>
            <p>Зелені маркери поділяються на:</p>
            <ol>
                <li><img src="/img/icons/split-markers/trees-map_icon.svg" class="w-5 inline-block"/> Дерева</li>
                <li><img src="/img/icons/split-markers/bushes-map_icon.svg" class="w-5 inline-block"/> Кущі </li>
                <li><img src="/img/icons/split-markers/hedges-map_icon.svg" class="w-5 inline-block"/> Живоплоти </li>
                <li><img src="/img/icons/split-markers/flowers-map_icon.svg" class="w-5 inline-block"/> Квіткові горщики </li>
            </ol>
            <p>Призначення кольорів ви побачите на легенді скріншоту.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/green-markers.jpg" alt="Зелені маркери.">
                    <figcaption>Зелені маркери.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/infra-markers.jpg" alt="Інфраструктурні маркери.">
                    <figcaption>Інфраструктурні маркери.</figcaption>
                </figure>
            </div>
        </template>

        <!-- Додавання та видалення маркерів -->
        <template v-if="chapter.key === 'markers-add-delete'">
            <p>Перейшовши до певного парку ви можете додати новий маркер. Кнопка для цього знаходиться внизу.</p>
            <p>Якщо ви знаходитеся в парку, точка автоматично виставиться на ваше розташування. Розмістіть її на мапі у бажане місце.</p>
            <div class="two-imgs-row">
                <figure><img src="/img/tutorial/mobile-admin.jpg" alt="Мобільне подання адміністративного меню.">
                    <figcaption>Мобільне подання адміністративного меню.</figcaption>
                </figure>
                <figure><img src="/img/tutorial/map-point.jpg" alt="Точка на мапі.">
                    <figcaption>Точка на мапі.</figcaption>
                </figure>
            </div>
            <p>Заповнення інформації про точку далі ідентичне редагуванню. Перегляньте розділ нижче, щоб дізнатися більше.</p>
            <p>Обов'язковим є обрання типу маркера. Інші характеристики можна задати згодом.</p>
            <p>Після створення маркер можна видалити, обравши на мапі.</p>
        </template>
        <!-- Редагування маркерів -->
        <template v-if="chapter.key === 'markers-edit'">
            <p>Всі властивості, притаманні маркеру, ви можете змінити або зразу при створенні або обравши маркер на мапі через кнопку ✏️.</p>
            <figure><img src="/img/tutorial/marker-editing.jpg" alt="Панель редагування маркера.">
                <figcaption>Панель редагування маркера.</figcaption>
            </figure>
            <p>Задайте всі необхідні характеристики шляхом введення або вибору із <strong>словників</strong>. Про них ви дізнаєтеся далі в інструкції.</p>
            <figure><img src="/img/tutorial/dict-picking.jpg" alt="Приклад обрання із словника.">
                <figcaption>Приклад обрання із словника.</figcaption>
            </figure>
            <p>Переміщайте маркер безпосередньо на мапі за потреби.</p>
            <p>Завершивши редагування, ви можете скинути або зберегти здійснені зміни.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/move-marker.jpg" alt="Переміщення маркера на мапі.">
                    <figcaption>Переміщення маркера на мапі.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/changes.jpg" alt="Збереження та скидання змін.">
                    <figcaption>Збереження та скидання змін.</figcaption>
                </figure>
            </div>
        </template>
        <!-- Додавання зображень -->
        <template v-if="chapter.key === 'media-add'">
            <p>Додавайте зображення для парків, зелених насаджень або інфраструктури. Для цього оберіть маркер та натисніть безпосередньо на іконку.</p>
            <figure>
                <img src="/img/tutorial/add-img.jpg" alt="Додавання зображення.">
                <figcaption>Додавання зображення.</figcaption>
            </figure>
            <p>Ви побачите меню обрання зображень. Оберіть потрібні і змініть їхній порядок за потреби, перетягуючи блоки знизу. 
            <i>Публічний опис наразі не відображається.</i></p>
            <figure>
                <img src="/img/tutorial/img-picker.jpg" alt="Обрання зображення.">
                <figcaption>Обрання зображення.</figcaption>
            </figure>
            <p>Можливість вибору зображень притаманна також <i>новинам</i>.</p>
        </template>

        <!-- СЛОВНИКИ -->
        <template v-if="chapter.key === 'dictionaries'">
            <p>Словники – це списки спільних для маркерів даних. Словники поділяються на:</p>
            <ol>
                <li>Класифікація насаджень: родини, роди та види для кожного з типів насаджень (дерев, кущів, живоплотів, квітів).</li>
                <li>Типи інфраструктури.</li>
                <li>Види робіт (рекомендацій).</li>
                <li>Теги.</li>
                <li>Виділи.</li>
                <li>Живоплоти (форма та тип ряду).</li>
            </ol>
            <figure>
                <img src="/img/tutorial/dict-taxonomy.jpg" alt="Приклад словника класифікацій.">
                <figcaption>Приклад словника класифікацій.</figcaption>
            </figure>
            <p>Словники служать в першу чергу для уникнення помилок при введенні та точності фільтрації.</p>
            <p>Також – для встановлення стандартних зображень та іконок для різних видів маркерів. 
                Вони відображаються тоді, коли маркер не містить власного зображення. 
                В разі, якщо для маркера було завантажено його особистте зображення – відображатиметься лише воно.</p>
            <p>Наприклад, якщо для конкретного <i>"клена польового"</i> не було додане його зображення, користувач побачить 
                загальне зображення виду <i>"клена польовий"</i>. Якщо вид не має зображення – загальне зображення роду <i>"клен"</i>.</p>
            <figure>
                <img src="/img/tutorial/dict-infra.jpg" alt="Можливості з орбання запасного зображення 🖼️ та іконки 🎨.">
                <figcaption>Можливості з орбання запасного зображення 🖼️ та іконки 🎨.</figcaption>
            </figure>
        </template>

        <!-- РОБОТИ ТА РЕКОМЕНДАЦІЇ -->
        <!-- Додавання та виконання робіт -->
        <template v-if="chapter.key === 'works-add-complete'">
            <p>Роботи відображаються для користувачів з відповідним рівнем доступу на маркерах насаджень.</p>
            <figure>
                <img src="/img/tutorial/works.jpg" alt="Перегляд робіт певного маркера.">
                <figcaption>Перегляд робіт певного маркера.</figcaption>
            </figure>
            <p>Менеджери можуть додавати роботи, а працівники – тільки виконувати або скасовувати виконання.</p>
            <p>Роботи додаються зі словників. Нові роботи можуть бути додані у словник прямо під час їхнього першого призначення.</p>
            <p>Додану роботу можна виконати натисканням на кнопку ✔️ або скасувати виконання натисканням на ⬅️.</p>
            <p>В кожної роботи можна переглянути дату призначення та того, хто призначив. Так само – інформацію про виконання.</p>
        </template>

        <!-- Розділ робіт -->
        <template v-if="chapter.key === 'works-section'">
            <p>Для зручного перегляду всіх активних робіт служить кнопка "роботи" при виборі парку. 
            Перейшовши по ній вам покаже всі маркери, які мають невиконані завдання.</p>
            <p>Ви можете надалі додавати будь-які фільтри до вибору.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/modes.jpg" alt="Режими перегляду парків.">
                    <figcaption>Режими перегляду парків.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/filters-works.jpg" alt="Фільтри робіт.">
                    <figcaption>Фільтри робіт.</figcaption>
                </figure>
            </div>
        </template>

        <!-- Групове призначення робіт -->
        <template v-if="chapter.key === 'works-bulk'">
            <p>Часто доводиться додавати певне завдання для зразу багатьох насаджень. 
                Для цього існує розділ <i>"групового призначення робіт"</i>.</p>
            <p>Обрати маркери можна у два способи: фільтром або відмітивши кожен з бажаних вручну на мапі.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/works-tick.jpg" alt="Додавання маркера до групового призначення.">
                    <figcaption>Додавання маркера до групового призначення.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/works-button.jpg" alt="Перехід у меню групового призначення.">
                    <figcaption>Перехід у меню групового призначення.</figcaption>
                </figure>
            </div>
            <p>Обравши кілька маркерів, ви можете призначити для них певну рекомендацію водночас.</p>
            <figure>
                <img src="/img/tutorial/works-menu.jpg" alt="Меню групового призначення.">
                <figcaption>Меню групового призначення.</figcaption>
            </figure>
        </template>

        <!-- НОВИНИ -->
        <template v-if="chapter.key === 'news'">
            <p>Якщо ви менеджер новин або адміністратор – ви можете додавати новини, 
            публікувати їх або зберігати як чернетки, а також змінювати їхню обкладинку.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/add-news.jpg" alt="Додавання новини.">
                    <figcaption>Додавання новини.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/manage-news.jpg" alt="Керування новиною.">
                    <figcaption>Керування новиною.</figcaption>
                </figure>
            </div>
            <p>Вміст новини можна міняти у спеціальному редакторі у стилі Wordpress.</p>
            <figure>
                <img src="/img/tutorial/edit-news.jpg" alt="Редагування новини.">
                <figcaption>Редагування новини.</figcaption>
            </figure>
            <p>Він передбачає наступний перелік функцій:</p>
            <ol>
                <li>Форматування тексту (заголовок, жирний, курсив і тп)</li>
                <li>Додавання посилань.</li>
                <li>Додавання зображень</li>
                <li>Зміна розміщення зображень на сторінці (зліва або справа огортається текстом, по центру – займає весь рядок).</li>
                <li>Зміна розміру зображень.</li>
                <li>Колонки (теж можуть корисні для розміщення зображень чи тексту).</li>
            </ol>
            <p>Зображення обираються із спільної медіатеки сайту, як у розділі з маркерами.</p>
            <p>Колонки та обтікання текстом забираються на мобільних пристроях для коректного відображення.</p>
        </template>

        <!-- ЕКСПОРТ ТА ІМПОРТ -->
        <!-- Експорт -->
        <template v-if="chapter.key === 'export'">
            <p>Експорт та імпорт дозволяють обмінюватися даними з іншими системами GIS в форматах 
                GeoJSON, Shapefile або зберігати дані як CSV (Excel).</p>
            <figure>
                <img src="/img/tutorial/export-btn.jpg" alt="Кнопка експорту.">
                <figcaption>Кнопка експорту.</figcaption>
            </figure>
            <p>При експорті в GeoJSON гарантоване коректне відображення кольорів і форм, в той час як Shapefile 
                не підтримує такий функціонал і вимагає додаткового налаштування <i>(файл стилів додається в zip-файл)</i>.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/export-menu.jpg" alt="Меню експорту.">
                    <figcaption>Меню експорту.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/export.jpg" alt="Експортовані маркери на geojson.io.">
                    <figcaption>Експортовані маркери на <a href="geojson.io" target="_blank" class="underline">geojson.io</a>.</figcaption>
                </figure>
            </div>
        </template>

        <!-- Імпорт -->
        <template v-if="chapter.key === 'import'">
            <p>При імпорті всі експортовані формати є зворотньо сумісними і можуть бути імпортовані назад після експорту.</p>
            <p>При збігу інвентарних номерів в базі даних сайту маркери будуть оновлені, при відсутності – додані нові.</p>
            <figure>
                <img src="/img/tutorial/import-menu.jpg" alt="Меню імпорту">
                <figcaption>Меню імпорту</figcaption>
            </figure>
            <p>Так само, імпортуються GeoJSON, Shapefile (в вигляді .zip архіву) та CSV.</p>
            <p>Якщо раптом імпорт був помилковим і замінив якісь потрібні дані, ми можемо відновити відомості з резервних копій, які робляться щоночі.</p>
            <p>Не соромтеся звернутися щодо імпорту великого обсягу даних до розробника 
                <a href="mailto:vasea.tshuh@gmail.com" class="underline">vasea.tshuh@gmail.com</a>.
                Я радо допоможу переконатися, що імпорт пройде безшовно.
            </p>
            <p>Якщо ви імпортуєте лише розміщення маркерів – це легкий і стандартний процес, його можна виконати самотужки без складнощів.</p>
            <p>Якщо ж дані містять більше інформації про маркер, вони повинні мати спеціальні назви, щоб зчитатися. Розробник надасть їх за запитом.</p>
        </template>

        <!-- АДМІНІСТРУВАННЯ -->
        <!-- Керування ролями -->
        <template v-if="chapter.key === 'roles'">
            <p>Адміністратор може видавати ролі з будь-яким рівнем доступу користувачам, що зареєструвалися. Так само він може змінити їх пізніше.</p>
            <p>Роль вище має всі ті ж привілеї, що і попередня, із додаванням властивих конкретно їй.</p>
            <p>Переглянути привілеї ролей ви можете на скріншоті нижче.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/roles-menu.jpg" alt="Меню ролей.">
                    <figcaption>Меню ролей.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/roles-list.jpg" alt="Список ролей.">
                    <figcaption>Список ролей.</figcaption>
                </figure>
            </div>
            <p>Призначати інших адміністраторів може лише суперадміністратор.</p>
        </template>

        <!-- Аудит -->
        <template v-if="chapter.key === 'audit'">
            <p>Адміністратор може переглядати аудит дій інших користувачів. Вкладка доступна із їхнього меню.</p>
            <figure>
                <img src="/img/tutorial/audit-btn.jpg" alt="Вкладка аудиту у меню користувачів.">
                <figcaption>Вкладка аудиту у меню користувачів.</figcaption>
            </figure>
            <p>Аудит містить фільтрацію за багатьма критеріями, а також дозволяє переглянути зміни в рамках конкретної дії користувача.</p>
            <div class="two-imgs-row">
                <figure>
                    <img src="/img/tutorial/audit-list.jpg" alt="Меню ролей.">
                    <figcaption>Меню ролей.</figcaption>
                </figure>
                <figure>
                    <img src="/img/tutorial/audit-single.jpg" alt="Список ролей.">
                    <figcaption>Список ролей.</figcaption>
                </figure>
            </div>
            <p>Автором окремих автоматичних дій може бути система.</p>
        </template>
        <!-- Резервне копіювання -->
        <template v-if="chapter.key === 'backups'">
            <p>Резервне копіювання здійснюється кожного дня о 3 ночі. Копії зберігаються 7 днів, після чого 
            ще 6 тижнів зберігаються дані станом на кожен понеділок.</p>
            <p>Крім бази даних копіюються також зображення.</p>
            <p>Для захисту від зловмисників дані копіюються на сервер, доступний лише розробнику. 
                Зверніться на адресу <a href="mailto:vasea.tshuh@gmail.com" class="underline">vasea.tshuh@gmail.com</a>,
                якщо хочете відновити якусь із резервних копій. Це швидка та проста процедура.
            </p>
        </template>

    </div>
    </Accordion>
</template>

<style scoped>
figure {
    @apply my-3 max-w-2xl mx-auto;
}
figcaption {
    @apply text-center mt-auto pt-2 text-sm text-gray-600
}
ol {
    @apply list-decimal pl-4 space-y-1
}
p, ol {
    @apply pb-4
}
img {
    @apply mx-auto max-h-96
}
.two-imgs-row {
    @apply grid sm:grid-cols-2 gap-4
}
.two-imgs-row img {
    @apply my-auto max-w-full h-auto
}
.two-imgs-row figure {
    @apply flex flex-col
}
</style>
